<?xml version="1.0"?>
<net name="onnx_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="?,3,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1_weights_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8, 3, 3, 3" offset="0" size="432" />
			<output>
				<port id="0" precision="FP16" names="conv1_weights">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv1_weights" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv@0" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_53.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="432" size="32" />
			<output>
				<port id="0" precision="FP32" names="conv1_bn_scale">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="464" size="32" />
			<output>
				<port id="0" precision="FP32" names="conv1_bn_offset">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv1_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="496" size="32" />
			<output>
				<port id="0" precision="FP32" names="conv1_bn_mean">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv1_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="528" size="32" />
			<output>
				<port id="0" precision="FP32" names="conv1_bn_variance">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="BatchNormalization@0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_0.tmp_2">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant@3_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="560" size="2" />
			<output>
				<port id="0" precision="FP16" names="Constant@3" />
			</output>
		</layer>
		<layer id="10" name="Constant@3" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="11" name="Constant@2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="562" size="2" />
			<output>
				<port id="0" precision="FP16" names="Constant@2" />
			</output>
		</layer>
		<layer id="12" name="Constant@2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="13" name="Constant@1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="564" size="2" />
			<output>
				<port id="0" precision="FP16" names="Constant@1" />
			</output>
		</layer>
		<layer id="14" name="Constant@1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="15" name="Add@0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="Add@0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Maximum_333" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Clip@0" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Clip@0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Mul@0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Mul@0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant@0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="560" size="2" />
			<output>
				<port id="0" precision="FP16" names="Constant@0" />
			</output>
		</layer>
		<layer id="20" name="Constant@0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="21" name="Div@0" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="hardswish_0.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv2_expand_weights_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8, 8, 1, 1" offset="566" size="128" />
			<output>
				<port id="0" precision="FP16" names="conv2_expand_weights">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="conv2_expand_weights" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv@1" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_54.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2_expand_bn_scale_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="694" size="16" />
			<output>
				<port id="0" precision="FP16" names="conv2_expand_bn_scale">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv2_expand_bn_scale" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv2_expand_bn_offset_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="710" size="16" />
			<output>
				<port id="0" precision="FP16" names="conv2_expand_bn_offset">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv2_expand_bn_offset" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv2_expand_bn_mean_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="726" size="16" />
			<output>
				<port id="0" precision="FP16" names="conv2_expand_bn_mean">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv2_expand_bn_mean" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv2_expand_bn_variance_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="742" size="16" />
			<output>
				<port id="0" precision="FP16" names="conv2_expand_bn_variance">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv2_expand_bn_variance" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="BatchNormalization@1" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_1.tmp_2">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Relu@0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_0.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv2_depthwise_weights_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8, 1, 3, 3" offset="758" size="144" />
			<output>
				<port id="0" precision="FP16" names="conv2_depthwise_weights">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv2_depthwise_weights" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_344" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="902" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="ShapeOf_345" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_342" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="910" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="40" name="Constant_343" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="918" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="VariadicSplit_346" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Divide_347" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Concat_348" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_349" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv@2" type="GroupConvolution" version="opset1">
			<data strides="2, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_0.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv2_depthwise_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="934" size="32" />
			<output>
				<port id="0" precision="FP32" names="conv2_depthwise_bn_scale">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="conv2_depthwise_bn_offset" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="966" size="32" />
			<output>
				<port id="0" precision="FP32" names="conv2_depthwise_bn_offset">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv2_depthwise_bn_mean_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="998" size="16" />
			<output>
				<port id="0" precision="FP16" names="conv2_depthwise_bn_mean">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="conv2_depthwise_bn_mean" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="conv2_depthwise_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="1014" size="32" />
			<output>
				<port id="0" precision="FP32" names="conv2_depthwise_bn_variance">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="BatchNormalization@2" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_2.tmp_2">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Relu@1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_1.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_393" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1046" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="54" name="ShapeOf_394" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="ShapeOf_395" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Squeeze_396" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" />
			</output>
		</layer>
		<layer id="57" name="Constant_392" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1054" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="58" name="Range_397" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="GlobalAveragePool@0" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="pool2d_0.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="conv2_se_1_weights_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 8, 1, 1" offset="1062" size="32" />
			<output>
				<port id="0" precision="FP16" names="conv2_se_1_weights">
					<dim>2</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv2_se_1_weights" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv@3" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_55.tmp_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv2_se_1_offset" type="Const" version="opset1">
			<data element_type="f32" shape="2" offset="1094" size="8" />
			<output>
				<port id="0" precision="FP32" names="conv2_se_1_offset">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant@4" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1102" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="Constant@4">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape@0" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Reshape@0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Add@1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_55.tmp_1">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Relu@2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_2.tmp_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv2_se_2_weights" type="Const" version="opset1">
			<data element_type="f32" shape="8, 2, 1, 1" offset="1134" size="64" />
			<output>
				<port id="0" precision="FP32" names="conv2_se_2_weights">
					<dim>8</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv@4" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_56.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv2_se_2_offset" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="1198" size="32" />
			<output>
				<port id="0" precision="FP32" names="conv2_se_2_offset">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant@5" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1230" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="Constant@5">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Reshape@1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Reshape@1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Add@2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_56.tmp_1">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_408" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1262" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="75" name="Constant_409_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="1266" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="76" name="Constant_409" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="77" name="HardSigmoid@0" type="HardSigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="hardsigmoid_0.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Mul@1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="conv2_linear_weights" type="Const" version="opset1">
			<data element_type="f32" shape="8, 8, 1, 1" offset="1268" size="256" />
			<output>
				<port id="0" precision="FP32" names="conv2_linear_weights">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv@5" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_57.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv2_linear_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="1524" size="32" />
			<output>
				<port id="0" precision="FP32" names="conv2_linear_bn_scale">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv2_linear_bn_offset_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="1556" size="16" />
			<output>
				<port id="0" precision="FP16" names="conv2_linear_bn_offset">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv2_linear_bn_offset" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv2_linear_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="1572" size="32" />
			<output>
				<port id="0" precision="FP32" names="conv2_linear_bn_mean">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv2_linear_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="1604" size="32" />
			<output>
				<port id="0" precision="FP32" names="conv2_linear_bn_variance">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="BatchNormalization@3" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_3.tmp_2">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="conv3_expand_weights_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 8, 1, 1" offset="1636" size="384" />
			<output>
				<port id="0" precision="FP16" names="conv3_expand_weights">
					<dim>24</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv3_expand_weights" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv@6" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_58.tmp_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="conv3_expand_bn_scale" type="Const" version="opset1">
			<data element_type="f32" shape="24" offset="2020" size="96" />
			<output>
				<port id="0" precision="FP32" names="conv3_expand_bn_scale">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv3_expand_bn_offset_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24" offset="2116" size="48" />
			<output>
				<port id="0" precision="FP16" names="conv3_expand_bn_offset">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="conv3_expand_bn_offset" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="conv3_expand_bn_mean_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24" offset="2164" size="48" />
			<output>
				<port id="0" precision="FP16" names="conv3_expand_bn_mean">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="conv3_expand_bn_mean" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="conv3_expand_bn_variance" type="Const" version="opset1">
			<data element_type="f32" shape="24" offset="2212" size="96" />
			<output>
				<port id="0" precision="FP32" names="conv3_expand_bn_variance">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="BatchNormalization@4" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>24</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>24</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_4.tmp_2">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Relu@3" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_3.tmp_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="conv3_depthwise_weights_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 1, 3, 3" offset="2308" size="432" />
			<output>
				<port id="0" precision="FP16" names="conv3_depthwise_weights">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="conv3_depthwise_weights" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_422" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2740" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="ShapeOf_423" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_420" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="910" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="103" name="Constant_421" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="918" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="VariadicSplit_424" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Divide_425" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Concat_426" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Reshape_427" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv@7" type="GroupConvolution" version="opset1">
			<data strides="2, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_1.tmp_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="conv3_depthwise_bn_scale_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24" offset="2748" size="48" />
			<output>
				<port id="0" precision="FP16" names="conv3_depthwise_bn_scale">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="conv3_depthwise_bn_scale" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="conv3_depthwise_bn_offset_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24" offset="2796" size="48" />
			<output>
				<port id="0" precision="FP16" names="conv3_depthwise_bn_offset">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="conv3_depthwise_bn_offset" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="conv3_depthwise_bn_mean" type="Const" version="opset1">
			<data element_type="f32" shape="24" offset="2844" size="96" />
			<output>
				<port id="0" precision="FP32" names="conv3_depthwise_bn_mean">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="conv3_depthwise_bn_variance_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24" offset="2940" size="48" />
			<output>
				<port id="0" precision="FP16" names="conv3_depthwise_bn_variance">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="conv3_depthwise_bn_variance" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="BatchNormalization@5" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>24</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>24</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_5.tmp_2">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Relu@4" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_4.tmp_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="conv3_linear_weights_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8, 24, 1, 1" offset="2988" size="384" />
			<output>
				<port id="0" precision="FP16" names="conv3_linear_weights">
					<dim>8</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="conv3_linear_weights" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Conv@8" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_59.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="conv3_linear_bn_scale_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="3372" size="16" />
			<output>
				<port id="0" precision="FP16" names="conv3_linear_bn_scale">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="conv3_linear_bn_scale" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="conv3_linear_bn_offset_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="3388" size="16" />
			<output>
				<port id="0" precision="FP16" names="conv3_linear_bn_offset">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="conv3_linear_bn_offset" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="conv3_linear_bn_mean_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="3404" size="16" />
			<output>
				<port id="0" precision="FP16" names="conv3_linear_bn_mean">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="conv3_linear_bn_mean" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="conv3_linear_bn_variance_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="3420" size="16" />
			<output>
				<port id="0" precision="FP16" names="conv3_linear_bn_variance">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="conv3_linear_bn_variance" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="BatchNormalization@6" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>8</dim>
