<?xml version="1.0"?>
<net name="onnx_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="?,3,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv2d_0.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8, 3, 3, 3" offset="0" size="432" />
			<output>
				<port id="0" precision="FP16" names="conv2d_0.w_0">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv2d_0.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_211.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="batch_norm_0.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="432" size="16" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_0.w_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="batch_norm_0.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="batch_norm_0.b_0" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="448" size="32" />
			<output>
				<port id="0" precision="FP32" names="batch_norm_0.b_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="batch_norm_0.w_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="480" size="16" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_0.w_1">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="batch_norm_0.w_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="batch_norm_0.w_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="496" size="16" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_0.w_2">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="batch_norm_0.w_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="BatchNormalization_0" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_0.tmp_3">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_3_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="512" size="2" />
			<output>
				<port id="0" precision="FP16" names="Constant_3" />
			</output>
		</layer>
		<layer id="13" name="Constant_3" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="14" name="Constant_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="514" size="2" />
			<output>
				<port id="0" precision="FP16" names="Constant_2" />
			</output>
		</layer>
		<layer id="15" name="Constant_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="16" name="Constant_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="516" size="2" />
			<output>
				<port id="0" precision="FP16" names="Constant_1" />
			</output>
		</layer>
		<layer id="17" name="Constant_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="18" name="Add_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="Add_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Maximum_4054" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Clip_0" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Clip_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Mul_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Mul_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="512" size="2" />
			<output>
				<port id="0" precision="FP16" names="Constant_0" />
			</output>
		</layer>
		<layer id="23" name="Constant_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="24" name="Div_0" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="hardswish_0.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2d_1.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8, 8, 1, 1" offset="518" size="128" />
			<output>
				<port id="0" precision="FP16" names="conv2d_1.w_0">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv2d_1.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_1" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_212.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="batch_norm_1.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="646" size="16" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_1.w_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="batch_norm_1.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="batch_norm_1.b_0" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="662" size="32" />
			<output>
				<port id="0" precision="FP32" names="batch_norm_1.b_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="batch_norm_1.w_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="694" size="16" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_1.w_1">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="batch_norm_1.w_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="batch_norm_1.w_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="710" size="16" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_1.w_2">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="batch_norm_1.w_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="BatchNormalization_1" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_1.tmp_3">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Relu_0" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_0.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="conv2d_2.w_0" type="Const" version="opset1">
			<data element_type="f32" shape="8, 1, 3, 3" offset="726" size="288" />
			<output>
				<port id="0" precision="FP32" names="conv2d_2.w_0">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_4065" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1014" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="ShapeOf_4066" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_4063" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1022" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="41" name="Constant_4064" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1030" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="VariadicSplit_4067" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Divide_4068" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Concat_4069" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_4070" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_2" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_0.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="batch_norm_2.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="1046" size="16" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_2.w_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="batch_norm_2.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="batch_norm_2.b_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="1062" size="16" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_2.b_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="batch_norm_2.b_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="batch_norm_2.w_1" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="1078" size="32" />
			<output>
				<port id="0" precision="FP32" names="batch_norm_2.w_1">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="batch_norm_2.w_2" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="1110" size="32" />
			<output>
				<port id="0" precision="FP32" names="batch_norm_2.w_2">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="BatchNormalization_2" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_2.tmp_3">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_1.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="conv2d_3.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8, 8, 1, 1" offset="1142" size="128" />
			<output>
				<port id="0" precision="FP16" names="conv2d_3.w_0">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv2d_3.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_3" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_213.tmp_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="batch_norm_3.w_0" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="1270" size="32" />
			<output>
				<port id="0" precision="FP32" names="batch_norm_3.w_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="batch_norm_3.b_0" type="Const" version="opset1">
			<data element_type="f32" shape="8" offset="1302" size="32" />
			<output>
				<port id="0" precision="FP32" names="batch_norm_3.b_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="batch_norm_3.w_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="1334" size="16" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_3.w_1">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="batch_norm_3.w_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="batch_norm_3.w_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8" offset="1350" size="16" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_3.w_2">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="batch_norm_3.w_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="BatchNormalization_3" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_3.tmp_3">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="elementwise_add_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv2d_4.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 8, 1, 1" offset="1366" size="512" />
			<output>
				<port id="0" precision="FP16" names="conv2d_4.w_0">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="conv2d_4.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_4" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_214.tmp_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="batch_norm_4.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32" offset="1878" size="64" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_4.w_0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="batch_norm_4.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="batch_norm_4.b_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32" offset="1942" size="64" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_4.b_0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="batch_norm_4.b_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="batch_norm_4.w_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32" offset="2006" size="64" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_4.w_1">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="batch_norm_4.w_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="batch_norm_4.w_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32" offset="2070" size="64" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_4.w_2">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="batch_norm_4.w_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="BatchNormalization_4" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_4.tmp_3">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_2.tmp_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="conv2d_5.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 3, 3" offset="2134" size="576" />
			<output>
				<port id="0" precision="FP16" names="conv2d_5.w_0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv2d_5.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_4123" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2710" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="ShapeOf_4124" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_4121" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1022" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="84" name="Constant_4122" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1030" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="VariadicSplit_4125" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Divide_4126" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Concat_4127" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_4128" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_5" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_1.tmp_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="batch_norm_5.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32" offset="2718" size="64" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_5.w_0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="batch_norm_5.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="batch_norm_5.b_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32" offset="2782" size="64" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_5.b_0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="batch_norm_5.b_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="batch_norm_5.w_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32" offset="2846" size="64" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_5.w_1">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="batch_norm_5.w_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="batch_norm_5.w_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32" offset="2910" size="64" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_5.w_2">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="batch_norm_5.w_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="BatchNormalization_5" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_5.tmp_3">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Relu_3" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_3.tmp_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="conv2d_6.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="2974" size="1024" />
			<output>
				<port id="0" precision="FP16" names="conv2d_6.w_0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="conv2d_6.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_6" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_215.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="batch_norm_6.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16" offset="3998" size="32" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_6.w_0">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="batch_norm_6.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="batch_norm_6.b_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16" offset="4030" size="32" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_6.b_0">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="batch_norm_6.b_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="batch_norm_6.w_1" type="Const" version="opset1">
			<data element_type="f32" shape="16" offset="4062" size="64" />
			<output>
				<port id="0" precision="FP32" names="batch_norm_6.w_1">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="batch_norm_6.w_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16" offset="4126" size="32" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_6.w_2">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="batch_norm_6.w_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="BatchNormalization_6" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>16</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_6.tmp_3">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="conv2d_7.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="40, 16, 1, 1" offset="4158" size="1280" />
			<output>
				<port id="0" precision="FP16" names="conv2d_7.w_0">
					<dim>40</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="conv2d_7.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>40</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>40</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_7" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>40</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d_216.tmp_0">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="batch_norm_7.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="40" offset="5438" size="80" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_7.w_0">
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="batch_norm_7.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="batch_norm_7.b_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="40" offset="5518" size="80" />
			<output>
				<port id="0" precision="FP16" names="batch_norm_7.b_0">
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="batch_norm_7.b_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="batch_norm_7.w_1" type="Const" version="opset1">
			<data element_type="f32" shape="40" offset="5598" size="160" />
			<output>
				<port id="0" precision="FP32" names="batch_norm_7.w_1">
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="batch_norm_7.w_2" type="Const" version="opset1">
			<data element_type="f32" shape="40" offset="5758" size="160" />
			<output>
				<port id="0" precision="FP32" names="batch_norm_7.w_2">
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="BatchNormalization_7" type="BatchNormInference" version="opset5">
			<data epsilon="9.9999997473787516e-06" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>40</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>40</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>40</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="batch_norm_7.tmp_3">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Relu_4" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_4.tmp_0">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="conv2d_8.w_0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="40, 1, 3, 3" offset="5918" size="720" />
			<output>
				<port id="0" precision="FP16" names="conv2d_8.w_0">
					<dim>40</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="conv2d_8.w_0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>40</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_4180" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="6638" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="ShapeOf_4181" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>40</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_4178" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1022" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="127" name="Constant_4179" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1030" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="VariadicSplit_4182" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Divide_4183" type="Divide" version="opset1">
